app/controllers/users_controller.rb

INSERT INTO "users" ("last_request_at", "created_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at") VALUES('2009-03-25 14:10:49', '2009-03-25 14:10:49', '1680b22e25fe66550803d0d544f841032ca54400c6e027d0fefce856b91a7f35ac0216f402ed67b5d26eb00f9079d3ea7b1c75a1a248a31518162fd3365a7709', '2009-03-25 14:10:49', '127.0.0.1', 'omljaCnLm35BfEPGZoIf', '2009-03-25 14:10:49', 'b9dcfdf53e82cf0e437ccbdce1ea0c315628f3e05f0456e30410012a6ed626aad3adc777027ca06f0f903233e0f07bad4958722eefadbe5c315bbf3e6f020d91', 1, NULL, 'mando', NULL)
---
  def create
    @user = User.new(params[:user])

    if @user.save